<a href="https://colab.research.google.com/github/yvid27/python_ML/blob/main/bases_python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introducción a Python

### bases

In [1]:
a=5+5
a

10

In [2]:
import math
math.floor(2.3) # Funcion piso

2

In [3]:
math.fabs(-5) # valor absoluto

5.0

In [4]:
math.factorial(3) # Factorial

6

# Ciencia de Datos

## Cargando librerias

In [6]:
import os  # manipular archivos
import math # calculos matemicos
import numpy as np # manejar numpy arrays y funciones
import pandas as pd # pandas series, panda dataframe
import scipy #funciones y 
import matplotlib.pyplot as plt
import seaborn as sns

In [7]:
os.mkdir('Data') # Crear carpeta Data

In [14]:
# Obtener el archivo de excel
!wget -O Data/retail_online_sample.xlsx https://github.com/see-ecuador/2020_11_PythonWeekend/blob/main/01_Bases_Python_DataScience/Data/retail_online_sample.xlsx

--2020-11-07 14:54:37--  https://github.com/see-ecuador/2020_11_PythonWeekend/blob/main/01_Bases_Python_DataScience/Data/retail_online_sample.xlsx
Resolving github.com (github.com)... 192.30.255.113
Connecting to github.com (github.com)|192.30.255.113|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: unspecified [text/html]
Saving to: ‘Data/retail_online_sample.xlsx’

Data/retail_online_     [ <=>                ]  84.13K  --.-KB/s    in 0.02s

2020-11-07 14:54:37 (4.61 MB/s) - ‘Data/retail_online_sample.xlsx’ saved [86149]

In [18]:
!gdown --id 1QEBpfA5Lm8yxWdevRBytj6YPaNr0uIkv

Downloading...
From: https://drive.google.com/uc?id=1QEBpfA5Lm8yxWdevRBytj6YPaNr0uIkv
To: /content/retail_online_sample.xlsx
100% 662k/662k [00:00<00:00, 96.7MB/s]

####3ro: Importar Datos

In [19]:
transacciones = pd.read_excel("Data/retail_online_sample.xlsx",
sheet_name = 'transacciones')
transacciones.head(5)

  InvoiceNo StockCode  Quantity  ... UnitPrice  CustomerID         Country
0    536378     21931        10  ...       195     14688.0  United Kingdom
1    536382     22379        10  ...        21     16098.0  United Kingdom
2    536394     22866        96  ...       185     13408.0  United Kingdom
3    536395     22866        48  ...        21     13767.0  United Kingdom
4    536398     22866        12  ...        21     13448.0  United Kingdom

[5 rows x 7 columns]

In [20]:
productos = pd.read_excel("Data/retail_online_sample.xlsx",
sheet_name = 'productos')
productos.head(5)

  StockCode                         Description
0     23064              CINDERELLA CHANDELIER
1     21002          ROSE DU SUD DRAWSTRING BAG
2     20831                    GOLD PHOTO FRAME
3     22964  3 PIECE SPACEBOY COOKIE CUTTER SET
4     22609             PENS ASSORTED SPACEBALL

In [21]:
transacciones

      InvoiceNo StockCode  Quantity  ... UnitPrice  CustomerID         Country
0        536378     21931        10  ...       195     14688.0  United Kingdom
1        536382     22379        10  ...        21     16098.0  United Kingdom
2        536394     22866        96  ...       185     13408.0  United Kingdom
3        536395     22866        48  ...        21     13767.0  United Kingdom
4        536398     22866        12  ...        21     13448.0  United Kingdom
...         ...       ...       ...  ...       ...         ...             ...
15672    581538     22992         1  ...       195     14446.0  United Kingdom
15673   C581569     20979        -5  ...       125     17315.0  United Kingdom
15674    581578    84997D         8  ...       415     12713.0         Germany
15675    581578     22992        12  ...       195     12713.0         Germany
15676    581579     21931        10  ...       179     17581.0  United Kingdom

[15677 rows x 7 columns]

##### ver que tipos de datos lo importo Python

In [22]:
transacciones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15677 entries, 0 to 15676
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    15677 non-null  object
 1   StockCode    15677 non-null  object
 2   Quantity     15677 non-null  int64
 3   InvoiceDate  15677 non-null  object
 4   UnitPrice    15677 non-null  int64
 5   CustomerID   11300 non-null  float64
 6   Country      15677 non-null  object
dtypes: float64(1), int64(2), object(4)
memory usage: 857.5+ KB

In [23]:
# Seleccionar una columna
productos['Description']

0                  CINDERELLA CHANDELIER
1              ROSE DU SUD DRAWSTRING BAG
2                        GOLD PHOTO FRAME
3      3 PIECE SPACEBOY COOKIE CUTTER SET
4                 PENS ASSORTED SPACEBALL
                     ...
95        FUSCHIA FLOWER PURSE WITH BEADS
96    ANTIQUE TALL SWIRLGLASS TRINKET POT
97          DROP EARRINGS W FLOWER & LEAF
98       HANGING CHICK  YELLOW DECORATION
99     WHITE/PINK CHICK EASTER DECORATION
Name: Description, Length: 100, dtype: object

In [24]:
# Seleccionar una columna
productos.Description

0                  CINDERELLA CHANDELIER
1              ROSE DU SUD DRAWSTRING BAG
2                        GOLD PHOTO FRAME
3      3 PIECE SPACEBOY COOKIE CUTTER SET
4                 PENS ASSORTED SPACEBALL
                     ...
95        FUSCHIA FLOWER PURSE WITH BEADS
96    ANTIQUE TALL SWIRLGLASS TRINKET POT
97          DROP EARRINGS W FLOWER & LEAF
98       HANGING CHICK  YELLOW DECORATION
99     WHITE/PINK CHICK EASTER DECORATION
Name: Description, Length: 100, dtype: object

In [25]:
# Seleccionar varias columnas
transacciones[ ['StockCode', 'Quantity', 'Country'] ]

      StockCode  Quantity         Country
0         21931        10  United Kingdom
1         22379        10  United Kingdom
2         22866        96  United Kingdom
3         22866        48  United Kingdom
4         22866        12  United Kingdom
...         ...       ...             ...
15672     22992         1  United Kingdom
15673     20979        -5  United Kingdom
15674    84997D         8         Germany
15675     22992        12         Germany
15676     21931        10  United Kingdom

[15677 rows x 3 columns]

In [26]:
# Filtrar Filas por número usando un slice (sólo iloc)
transacciones.iloc[ 0:4]

  InvoiceNo StockCode  Quantity  ... UnitPrice  CustomerID         Country
0    536378     21931        10  ...       195     14688.0  United Kingdom
1    536382     22379        10  ...        21     16098.0  United Kingdom
2    536394     22866        96  ...       185     13408.0  United Kingdom
3    536395     22866        48  ...        21     13767.0  United Kingdom

[4 rows x 7 columns]

In [27]:
# Filtrar filas según una condición loc
# Filtrar transacciones cuyo tiempo de servicio sea mayor a 100
transacciones.loc[ (transacciones["Country"] == "United Kingdom") &
(transacciones["Quantity"] > 10) ]

      InvoiceNo StockCode  Quantity  ... UnitPrice  CustomerID         Country
2        536394     22866        96  ...       185     13408.0  United Kingdom
3        536395     22866        48  ...        21     13767.0  United Kingdom
4        536398     22866        12  ...        21     13448.0  United Kingdom
8        536404     22773        12  ...       125     16218.0  United Kingdom
9        536404     22964        12  ...        21     16218.0  United Kingdom
...         ...       ...       ...  ...       ...         ...             ...
15627    581475     22380        20  ...        79     13069.0  United Kingdom
15631    581488     22179        24  ...       595     17428.0  United Kingdom
15657    581496     20831        12  ...        79     16558.0  United Kingdom
15665    581514    84031B        14  ...       125     17754.0  United Kingdom
15666    581514     22068        14  ...        39     17754.0  United Kingdom

[3007 rows x 7 columns]

##Ordenar los datos
###Para ordenar los datos usamos .sort_values() así:
  - df.sort_values( "columna")
  - df.sort_values( "columna", ascenascending=False)<-descendente

In [28]:
transacciones.sort_values( "Quantity")

      InvoiceNo StockCode  Quantity  ... UnitPrice  CustomerID         Country
5784     552733     23059     -2376  ...         0         NaN  United Kingdom
2295    C542693     15036      -600  ...        65     12908.0  United Kingdom
13845    576765     22219      -550  ...         0         NaN  United Kingdom
8553     561086     15036      -530  ...         0         NaN  United Kingdom
11209    569341     82600      -458  ...         0         NaN  United Kingdom
...         ...       ...       ...  ...       ...         ...             ...
7169     557092     15036       600  ...        72     12908.0  United Kingdom
11395    569815     22379       700  ...       185     15838.0  United Kingdom
8906     562285     15036       720  ...        72     17404.0          Sweden
7817     559047     15036      1200  ...        72     13082.0  United Kingdom
2478     543192     15036      1200  ...        65     17381.0  United Kingdom

[15677 rows x 7 columns]

##Crear o modi car columnas/variables
  dataFrame['nueva_Var'] = ....
  Crear una nueva columna con el tiempo en minutos, opc

In [33]:
transacciones['Cantidad_10'] = transacciones['Quantity']*10
transacciones.head(5)

  InvoiceNo StockCode  Quantity  ... CustomerID         Country  Cantidad_10
0    536378     21931        10  ...    14688.0  United Kingdom          100
1    536382     22379        10  ...    16098.0  United Kingdom          100
2    536394     22866        96  ...    13408.0  United Kingdom          960
3    536395     22866        48  ...    13767.0  United Kingdom          480
4    536398     22866        12  ...    13448.0  United Kingdom          120

[5 rows x 8 columns]

##Eliminar columnas
Para eliminar se usa del y .drop

In [34]:
# borrar una columna "in-place"
del transacciones['Cantidad_10']

##Crear o modi car columnas/variables

**Con esto ya podemos modificar la columna 'InvoiceDate' y pasarla a tipo fecha

In [35]:
# Cambiar la columna data a fecha
transacciones["InvoiceDate"] = pd.to_datetime(transacciones["InvoiceDate"])
transacciones["CustomerID"] = transacciones["CustomerID"].astype(str)
transacciones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15677 entries, 0 to 15676
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    15677 non-null  object
 1   StockCode    15677 non-null  object
 2   Quantity     15677 non-null  int64
 3   InvoiceDate  15677 non-null  datetime64[ns]
 4   UnitPrice    15677 non-null  int64
 5   CustomerID   15677 non-null  object
 6   Country      15677 non-null  object
dtypes: datetime64[ns](1), int64(2), object(4)
memory usage: 857.5+ KB

#Unir datos - Merge|Join|Buscarv

In [36]:
# Left join
transacciones= transacciones.merge(productos,
how='left', left_on='StockCode', right_on= 'StockCode')
transacciones.head(5)

  InvoiceNo StockCode  ...         Country                    Description
0    536378     21931  ...  United Kingdom         JUMBO STORAGE BAG SUKI
1    536382     22379  ...  United Kingdom       RECYCLING BAG RETROSPOT
2    536394     22866  ...  United Kingdom  HAND WARMER SCOTTY DOG DESIGN
3    536395     22866  ...  United Kingdom  HAND WARMER SCOTTY DOG DESIGN
4    536398     22866  ...  United Kingdom  HAND WARMER SCOTTY DOG DESIGN

[5 rows x 8 columns]

##Pandas - Descriptivas

In [37]:
transacciones.describe()

           Quantity     UnitPrice
count  15677.000000  15677.000000
mean       9.307521    316.796453
std       40.151242    565.844724
min    -2376.000000      0.000000
25%        1.000000     85.000000
50%        3.000000    195.000000
75%       10.000000    375.000000
max     1200.000000   9996.000000

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [40]:
# Media de la cantidad
transacciones['Quantity'].mean()
# Media acotada de la cantidad
scipy.stats.trim_mean(transacciones.Quantity , 0.05)

5.603642548366523